cases/lab_scale/case2B/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
     mud
     {
         transportModel Hsu2013; 
         nu0 0.45; 
         //transportModel Newtonian;
         //nu             0.00211;
         rho 1420;
     }

     water
     {
         transportModel Newtonian;
         nu             1e-06;
         rho            1000;
     }

     air
     {
         transportModel Newtonian;
         nu             1.48e-05;
         rho            1;
     }
);

sigmas
(
    (air water) 0.07
    (air mud) 0.07
    (water mud) 0.07
);

// ************************************************************************* //
