cases/lab_scale/case2B/constant/waveDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        regular;

waveTheory      streamFunction;

genAbs          1;

absDir          0.0;

nPaddles        1;

waveHeight      0.040000;

wavePeriod      0.900000;

waveLength      1.114545;

uMean      1.244923;

waveDir         0.0;

//wavePhase       1.57079633;

// Parameters for setOla
setWaterLevel      0.240000;
setWaterDepth      0.240000;

// Change both entries to true to re-read this dictionary upon restart.
rereadAlpha     false;
rereadU         false;

Bj
32
(
  7.53522757883201e-02	
  2.04739876847897e-03	
 -1.54820076394399e-05	
 -2.12634778528760e-06	
  7.77491500300758e-08	
  6.14594598105809e-09	
 -2.72112667917729e-10	
 -1.83215532563027e-11	
  1.21726286149388e-12	
  6.43479639905815e-14	
 -5.46154396947185e-15	
 -2.24693145701304e-16	
  2.54228188024599e-17	
  1.02471004731377e-18	
 -9.70161395284545e-19	
  2.04240358424389e-18	
 -2.78523009260467e-18	
  2.66742821914714e-18	
 -1.05747525352604e-18	
 -5.43803528225942e-19	
  4.18210887697310e-19	
 -2.51055089365034e-19	
  1.20185716183954e-18	
 -2.31931324515879e-18	
  3.21591339391238e-18	
 -3.86123919116129e-18	
  4.24038566758872e-18	
 -3.94000136949214e-18	
  2.51762405948120e-18	
 -3.26894481900576e-19	
 -2.09663268242788e-18	
  1.48664510451710e-18	
);

Ej
32
(
	  8.24133933036111e-02
	  7.82502074079339e-03
	  9.01086340021697e-04
	  1.22979470366825e-04
	  1.85106642947718e-05
	  2.96166612058079e-06
	  4.94201842662879e-07
	  8.50433390563869e-08
	  1.49828046733273e-08
	  2.68911935695279e-09
	  4.89953280889564e-10
	  9.03840137219274e-11
	  1.68483912899116e-11
	  3.16872328215279e-12
	  6.00531936458151e-13
	  1.14577058105929e-13
	  2.19872036885116e-14
	  4.24220589412475e-15
	  8.22272381358596e-16
	  1.60973656825512e-16
	  3.64229253175836e-17
	  5.69874626150448e-18
	  3.68960600831360e-18
	  3.20128961118378e-18
	  6.16562056042700e-18
	  1.69157808339074e-18
	 -6.85458491304414e-18
	  3.08641004852567e-18
	  2.16737354726083e-18
	 -5.97874563152539e-19
	 -3.72466462144087e-18
	 -2.56428713159456e-18
);




// ************************************************************************* //
