cases/lab_scale/case2B/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "alpha.*"
    {
        nAlphaSubCycles 2;  // Increase for more accurate phase change
        alphaOuterCorrectors yes;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    5;  // Increase limiter iterations to reduce diffusion

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
   "pcorr.*" 
    {
	solver           GAMG;
        tolerance        1e-8;
        relTol           0.0;
        smoother         DIC;//GaussSeidel;
    };
    p_rgh
    {
	solver           GAMG;
        tolerance        1e-8;
        relTol           0.05;
        smoother         DIC;//GaussSeidel;
    };
    p_rghFinal
    {
        $p_rgh;
        relTol           0.0;
    };
    "U|UFinal"
    {
	solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-09;
        relTol           0;
    };
    "tauP|tauPFinal"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
        nSweeps         1;
    }
}

PIMPLE
{
    pRefCell       0;
    pRefValue      0;
    momentumPredictor yes;
    nOuterCorrectors 1; 
    nCorrectors     4;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    equations
    {
        "U.*"           1;
    }
}

// ************************************************************************* //
