cases/lab_scale/case2B/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.water 0
    volScalarFieldValue alpha.mud 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (0 0 0) (20 1 0.24);
        fieldValues
        (
            volScalarFieldValue alpha.mud 0
            volScalarFieldValue alpha.water 1
            volScalarFieldValue alpha.air 0
        );
    }
    boxToCell
    {
        box (0 0 -0.06) (20 1 0);
        fieldValues
        (
            volScalarFieldValue alpha.mud 1
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.air 0
        );
    }
);


// ************************************************************************* //
